In [44]:
import pandas as pd 
import numpy as np
import platform
print(platform.python_version())

2.7.15

In [45]:
data_path='D:/curso_linkage/dataset_a_v3.csv'
df_a=pd.read_csv(data_path, sep=';')

In [46]:
data_path='D:/curso_linkage/dataset_b_v3.csv'
df_b=pd.read_csv(data_path, sep=';')

In [47]:
df_a.dtypes

cod               int64
nome             object
dn               object
sexo             object
mae              object
cidade            int64
primeiro_nome    object
dtype: object

In [48]:
df_b.dtypes

cod               int64
nome             object
dn               object
sexo             object
mae              object
cidade            int64
primeiro_nome    object
dtype: object

In [30]:
#df_b.to_csv("D:/curso_linkage/dataset_b_preprocess_v2.csv",sep=";",index=False)
#df_b['dn'] = df_b['dn'].dt.strftime('%m/%d/%Y')

In [ ]:
#df_a['primeiro_nome'] = df_a['nome'].str.split(' ', 1).str[0]
#df_b['primeiro_nome'] = df_b['nome'].str.split(' ', 1).str[0]

In [33]:
df_a.shape

(100, 7)

In [34]:
df_b.shape

(20, 7)

In [35]:
df_a.dtypes

cod               int64
nome             object
dn               object
sexo             object
mae              object
cidade            int64
primeiro_nome    object
dtype: object

In [36]:
df_b.dtypes

cod               int64
nome             object
dn               object
sexo             object
mae              object
cidade            int64
primeiro_nome    object
dtype: object

In [16]:
df_a.head()

,cod,nome,dn,sexo,mae,cidade,primeiro_nome
0,1,EDSON GOMES DOS SANTOS,1-01-2007,1,WEDILAINE VIEIRA BEZERRA,280030,EDSON
1,2,ALESSANDRA KAUANÈ SOUZA DOS SANTOS,1-02-2008,2,VITORIA LUCIA AMORIM DE SOUZA,280740,ALESSANDRA
2,3,DAVI GONÇALVES DA &Ä!! ROCHA,1-04-2007,1,VILMA GOMES MOREIRA,280030,DAVI
3,4,ALISON DE JESUS TAVARES,1-05-2007,2,VERA LUCIA FRANCISCO PRECOPE,280030,ALISON
4,5,DANNYEL COSTA DE MORAES,1-12-2006,1,VANILDA TRINDADE PEREIRA,280030,DANNYEL

In [17]:
df_b.head()

,cod,nome,dn,sexo,mae,cidade,primeiro_nome
0,1,EDU PEREIRA TAVACHO,09/13/2007,1,SIMONE ANTONIA RODRIGUES,280030,EDU
1,2,JOSE IGOR SANTANA DOS SANTOS,05/17/2007,1,NICOLINA FATIMA MACHADO,280030,JOSE
2,3,JOSE ITALO SANTANA SANTOS,09/17/2006,1,NADJA MARINHO DOS SANTOS,280030,JOSE
3,4,CARLOS ALEXANDRE S RODRIGUES,02/18/2008,1,MIRIAN BARBOSA DE ARAUJO,280030,CARLOS
4,5,LEON WAGNER DE ARAUJO TELES,11/18/2007,1,MILLENE SARA ROCHA DOS REIS MOTA,280030,LEON

In [18]:
df_a['sexo'].value_counts()

1    47
2    35
M    11
F     7
Name: sexo, dtype: int64

In [19]:
df_b['sexo'].value_counts()

1    15
2     4
M     1
Name: sexo, dtype: int64

In [37]:
# Removing spaces:
df_a.nome = df_a.nome.replace('\s+', ' ', regex=True)
df_b.nome = df_b.nome.replace('\s+', ' ', regex=True)

# Removing special characteres
df_a.nome = df_a.nome.replace(r"[^a-zA-Z ]+", " ",regex=True)
df_b.nome = df_b.nome.replace(r"[^a-zA-Z ]+", " ",regex=True)

# Transforming date variables into date type
df_a.dn = pd.to_datetime(df_a['dn'], errors='coerce')
df_b.dn = pd.to_datetime(df_b['dn'], errors='coerce')

#corrigir variável categorica sexo: M para 1/ F para 2
df_a['sexo'].replace(["M","F"],['1','2'],inplace=True)
df_b['sexo'].replace(["M","F"],['1','2'],inplace=True)


#fix date in base b
#df_b['dn'] = df_b['dn'].dt.strftime('%d/%d/%Y')

In [38]:
df_a['sexo'].value_counts()

1    58
2    42
Name: sexo, dtype: int64

In [39]:
df_b['sexo'].value_counts()

1    16
2     4
Name: sexo, dtype: int64

In [40]:
df_a.dtypes

cod                       int64
nome                     object
dn               datetime64[ns]
sexo                     object
mae                      object
cidade                    int64
primeiro_nome            object
dtype: object

In [41]:
df_b.dtypes

cod                       int64
nome                     object
dn               datetime64[ns]
sexo                     object
mae                      object
cidade                    int64
primeiro_nome            object
dtype: object

In [43]:
df_a.head()

,cod,nome,dn,sexo,mae,cidade,primeiro_nome
0,1,EDSON GOMES DOS SANTOS,2007-01-01,1,WEDILAINE VIEIRA BEZERRA,280030,EDSON
1,2,ALESSANDRA KAUAN SOUZA DOS SANTOS,2008-01-02,2,VITORIA LUCIA AMORIM DE SOUZA,280740,ALESSANDRA
2,3,DAVI GON ALVES DA ROCHA,2007-01-04,1,VILMA GOMES MOREIRA,280030,DAVI
3,4,ALISON DE JESUS TAVARES,2007-01-05,2,VERA LUCIA FRANCISCO PRECOPE,280030,ALISON
4,5,DANNYEL COSTA DE MORAES,2006-01-12,1,VANILDA TRINDADE PEREIRA,280030,DANNYEL

In [ ]:
df_a.to_csv("D:/curso_linkage/dataset_a_preprocess.csv",sep=";",index=False)
df_b.to_csv("D:/curso_linkage/dataset_b_preprocess.csv",sep=";",index=False)